{
    "name": "Josiah's lodgings",
    "image": "josiah.png",
    "things": [
    ],
    "blotter" : [
      "An agreeable evening awaits with your old friend Josiah.",
      "He lives at the Travellers' Club, ancient haunt of explorers and spies",
      "You pause at the door. Something's not right."
    ],
    "menu": [
      {
        "condition": [],
        "block": ["dead", "rest in peace", "Anton"],
        "label": "Knock",
        "time": [0, -1],
        "help": [
          "Knock politely and wait"
        ],
        "result": [
          "A terrible noise. You force the door.",
          "Through blowing curtains, a shadowy figure flees over the terrae and is gone",
          "Josiah's corpse lies on the floor, his blood drained"
        ],
        "clues": ["rest in peace", "Anton's room"],
        "action": "plot"
      },
      {
        "condition": [],
        "block": ["rest in peace", "dead", "Anton"],
        "label": "Roof terrace",
        "time": [0, 10],
        "help": [
          "His room overlooks the roof terrace.",
          "You could peek through his window. This might annoy him."
        ],
        "result": [
          "You see the vampire Anton drinking the last of Josiah's life"
        ],
        "clues": ["Anton"],
        "action": "plot"
      },
      {
        "condition": ["rest in peace"],
        "block": ["dead", "academic paper"],
        "label": "Contemplation",
        "time": [0, -1],
        "help": [
          "The still of the night, of death,",
          "all senses strained for the slightest clue"
        ],
        "result": [
          "You're drawn to a printout on a shelf. An academic paper on lies. You sit and read",
          "It seems lieing is hard: hard to keep the story straight.",
          "The paper outlines a way to use artificial intelligence to maintain a set of lies.",
          "This can be used to control the media in a post-truth world."
        ],
        "clues": ["academic paper"],
        "action": "plot"
      },
      {
        "condition": ["Anton"],
        "block": ["rest in peace", "Anton's room"],
        "label": "Attack",
        "time": [0, 12],
        "help": [
          "To attack in human form would be suicide"
        ],
        "result": [
          "Your enemy springs. The fight is short, brutal and one-sided.",
          "Fighting in human form, you are torn apart. Hells fires welcome you."
        ],
        "clues": ["dead"],
        "action": "dead.json"
      },
      {
        "condition": ["Anton"],
        "block": ["rest in peace", "dead", "wounds", "Anton's room"],
        "label": "Rage!",
        "time": [0, 12],
        "help": [
          "Draw on the beast within for extra strength. To the death!",
          "The masquerade is everything. If humans see you in beast form,",
          "you will be killed in a blood hunt."
        ],
        "result": [
          "Using your unnatural strength, the fight is short, brutal and lethally balanced.",
          "You tear him apart. Your wounds are grave. His corpse fades to dusty wind.",
          "Josiah's wardrobe replaces your torn clothes. Your appearance fades back to human."
        ],
        "clues": ["Anton dead", "wounds", "Anton's room"],
        "action": "plot"
      },
      {
        "condition": ["Anton"],
        "block": ["rest in peace", "dead", "Anton dead"],
        "label": "Caution",
        "time": [12,-1],
        "help": [
          "Avoid a fight. Let Anton leave."
        ],
        "result": [
          "(Anton) You are wise not to intervene. I'm sorry for your friend.",
          "(Anton) But he knew too much. Maybe some day you'll join us.",
          "The vampire leaves by the window, his form fading into the shadows.",
          "You harden your heart to Josiah's death. A necessarily evil.",
          "Your humanity ebbs, the beast is stronger, you own the night."
        ],
        "clues": ["Anton friendly", "Anton's room"],
        "action": "plot"
      },
      {
        "condition": ["Anton's room"],
        "block": ["Anton's letter", "dead"],
        "label": "The desk",
        "time": [0, -1],
        "help": [
          ""
        ],
        "result": [
          "Ashes of a letter in the ash-tray.",
          "Yet you work out its gist from the pen's faint imprint on the leather desk.",
          "Josiah wrote to warn you of a plot to end truth, a computer of lies, that he must flee",
          "IT STARTS TOMORROW!"
        ],
        "clues": ["Anton's letter"],
        "action": "plot"
      },
      {
        "condition": ["Anton's letter"],
        "block": ["dead"],
        "label": "Leave",
        "time": [0, -1],
        "help": [
          "Best not to hang about. This would be hard to explain to the police."
        ],
        "result": [
          "Despite your inner turmoil, you appear calm as you stroll out onto Pall Mall."
        ],
        "clues": [],
        "action": "main.json"
      }
    ]
}
